#include <stdio.h>

int main() {
  int N,i,o,k,summa, eq,digit;
  digit=0;
  int B[1000];
  printf("Введите N:\n"); //Задаём число элементов массива
  scanf("%d", &N);
  
  int A[N]; //Задаём и забиваем сам массив
  printf("Количество элементов массива равно:\t%d\n",N);
  printf("Введите элементы массива:\n");
  for (i=0; i<N; i++){
    printf("A[%d]=",i);
    scanf("%d", &A[i]);
    }

  printf("Введённый массив двоичных чисел:\n"); //Выводим множество двоичных чисел
  for(i=0; i<N; i++){
    printf("%8d", A[i]);
    }

  for (i=0; i<N; i++){ //Проверяем корректность заполнения
    o=0;
    eq= A[i];
    while (A[i] != 0){
      o = A[i] % 10;
      A[i]= A[i] / 10;
      if (o != 0 && o != 1){
        digit++;
        }
      }
    A[i]= eq;
    }
  
  if (digit !=0){
  printf("\nМАССИВ ЗАПОЛНЕН НЕВЕРНО!!!\n");
    }
    
  else{
    for (i=0; i<N; i++){ //Преобразование двоичных чисел
      o=0;
      k=0;
      while(A[i] != 0){
        o = A[i] % 10;
        A[i] = A[i] / 10;
        summa += o * pow(2, k);
        k++;
        }
      B[i] = summa;
      summa = 0;
      }
    
    printf("\nМассив их десятичных чисел:\n"); //Выводим результат - множество десятичных чисел
    for(i=0; i<N; i++){
      printf("%4d", B[i]);
      }
    }
  }
